[{"img":"https://cdn.lynda.com/course/661811/661811-636578309063453014-16x9.jpg","title":"Practical HTML for Marketing Projects","level":"Beginner","creater":"Jen Kramer","date":"March 30, 2018","decription":"HTML is an essential programming language that's highly useful for structuring documents for the web. In this course, learn the basics of HTML markup code as they apply to common marketing projects. Instructor Jen Kramer explains what HTML is, exactly, and goes over techniques and concepts that can help you confidently approach marketing tasks such as formatting email newsletters and making simple updates to a website. She covers head and body tags, lists, implementing images, creating tables, editing raw HTML in MailChimp, and more.","no_learner":"13,530 ","video_link":"https://dms.licdn.com/playlist/C560DAQFSHMjHOjiHWA/learning-original-video-vbr-720/0/1598800275924?e=1645617600&v=beta&t=IGPYtBGDf918Eo4o_d3bAm36sJNe0rSU4JtvmTzKFUI"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRTrEWIscfDqFoONOvHPAnf3v4iEOVT-XkP3A&usqp=CAU","title":"HTML and CSS: Creating Navigation Bars","level":"Intermediate","creater":"Jen Kramer","date":"August 13, 2021","decription":"Even if your product or service is truly original, the app or site you build for it is going to share elements with every other app or site on the planet. Take, for example, the humble navigation bar, which your users need to find their way through your site. In this course, instructor Jen Kramer demonstrates how to create beautiful, accessible navbars using HTML and CSS techniques that work in any web context. Jen starts by detailing the proper markup for a nav bar and the box model associated with its elements. She then goes over how to style both vertical and horizontal navigation bars—including how to put a logo right in the middle of a horizontal navbar. Finally, Jen shares a few advanced tricks, including how to create dropdowns and mobile layouts with hamburger buttons with CSS, no JavaScript required.","no_learner":"2,285","video_link":"https://dms.licdn.com/playlist/C4E0DAQF8C0OHdI8FRA/learning-original-video-vbr-720/0/1628712945444?e=1645617600&v=beta&t=dOOulXWVtfxIwTTRyubjiHcntowKBdD6vnC4C36s1lQ"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"Learning HTML Canvas","level":"Intermediate","creater":"Joe Marini","date":"November 26, 2018","decription":"JavaScript developers can create freeform graphics on a drawing surface known as the Canvas. The Canvas unlocks the ability to create rich, native web applications with 2D and 3D graphics. In this course, instructor Joe Marini introduces the technical concepts behind Canvas and shows how to perform drawing operations directly in a webpage. Learn how to draw basic and complex shapes, adjust colors and styles, and add shadows, patterns, and gradients. Then explore more advanced techniques such as scaling, rotating, and compositing objects. Plus, discover how to use Canvas elements to build a full-featured slideshow and a double-buffered animation.","no_learner":"7,379","video_link":"https://dms.licdn.com/playlist/C560DAQEk1HolIlBpBw/learning-original-video-vbr-720/0/1598818310218?e=1645617600&v=beta&t=vnPaG_oXmIsHOJuj9OCmUmkGjknkBjalUTBZQ4iI5WQ"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"Creating a Responsive HTML Email","level":"Intermediate","creater":"Chris Converse","date":"22,008","decription":"Designing HTML emails can be challenging, considering the limited capabilities of desktop and web email readers, combined with the small screen sizes of mobile devices. Enter responsive HTML email. Let Chris Converse show you how to design an elegant email that will adapt to varying screen sizes and render correctly in over 30 different mail clients, including Gmail, Yahoo, AOL, and multiple versions of Outlook, as well as Android, iOS, and Windows phones. Learn to add complex features like background graphics, rounded corners, and shadows that don't break your email when they can't be displayed. Then create call-to-action buttons, add animation, and style the whole thing with CSS. Plus, explore tools and services that will help you test your campaigns. Start now and learn what is possible with HTML email.","no_learner":"22,008","video_link":"https://dms.licdn.com/playlist/C4E0DAQFIuIvGQOuNng/learning-original-video-vbr-720/0/1598949678961?e=1645617600&v=beta&t=w296amz2ySvqsEhcpIEC6Xper1OdbhQqZUJ_iyvD_6c"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML: Tables","level":"Beginner","creater":"Jen Kramer","date":"January 23, 2020","decription":"Sometimes you need to share data, and not just visualizations, directly with other people. HTML tables make this easy. While they have a complex history of use and misuse, HTML tables are great at their key purpose: presenting data.  In this course, learn how to create table structures that fit your data precisely, are easy to style, and work well for sharing. Instructor Jen Kramer covers the essential skills you need to learn to display and format tabular data on the web. Watch and learn how to build tables with HTML, style tables with CSS, and make your tables accessible to users with disabilities on all types of devices.","no_learner":"2,643","video_link":"https://dms.licdn.com/playlist/C560DAQE-q1p1mGh8kQ/learning-original-video-vbr-720/0/1599184468529?e=1645617600&v=beta&t=kZQ_Acc5ClfUEEtmyaWyydyqlgvZiEke-nRRN7EugCw"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML and CSS: Linking","level":"Intermediate","creater":"Jen Kramer","date":"March 8, 2021","decription":"Hyperlinks are the foundation of the World Wide Web, but they come in many different flavors.  Do you want to link to a specific point in a document?  Make a phone call, or send an email?  Link from images or dedicated navigation bars instead of text?  In this course, instructor Jen Kramer gives you all the tools you need to make those tasks easy. Jen goes over basic links, linking to different files and resources, and linking from images, headers, text, and more. She shows you how you can style links and individual link states using CSS selectors, then goes into how you can make exceptions and create different styles. Jen covers the steps you should take to maintain links and redirect them when necessary.","no_learner":"6,227","video_link":"https://dms.licdn.com/playlist/C560DAQEakYo7IaYOGg/learning-original-video-vbr-720/0/1614637852111?e=1645621200&v=beta&t=VsgZMCLTy9lOKdFO2t2m1vnXZZX3DLAqySXOu69Zs2w"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML: Structured Semantic Data","level":"Advanced","creater":"Jen Kramer","date":"July 1, 2020","decription":"Web development focuses on creating highly visual content, but many crawlers ignore the layouts and imagery that give human readers context. To aid Google Search and other bots, you can use structured semantic data. This invisible but critical metadata determines how your sites appear online and can help boost your search rankings. In this course, Jen Kramer shows how to add data structured for machine readers to pages also intended for humans. Learn how to describe content in schemas, use meta tags, and leverage tools like the Structured Data Markup Helper and Structured Data Testing Tool—both from Google—to add microdata and JSON-LD code to your pages. In chapter three, Jen provides several structured data examples as well as a challenge to test your ability to provide rich search results.","no_learner":"3,949","video_link":"https://dms.licdn.com/playlist/C560DAQHFGKSwQKgHCQ/learning-original-video-vbr-720/0/1598868853314?e=1645621200&v=beta&t=wv1Nuutva995L-jlta_V_bG7_I1a6Ny_UWiw35HH5bY"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"Introducing HTML","level":"Beginner","creater":"Jen Kramer","date":"June 21, 2021","decription":"Websites and web applications are—by their very nature—accessible remotely, which puts them at high risk of cyberattacks. Knowing how to detect and prevent web attacks is a critical skill for developers and information security professionals alike. In this course, find out about existing and emerging web protocols and how to test your sites and applications for weaknesses. Cybersecurity expert Malcolm Shore examines the various parts of a web application and introduces the Open Web Application Security Project (OWASP), which provides documentation, tools, and forums for web developers and testers. He also provides an overview of popular testing tools, including Burp Suite and OWASP ZAP. Learn how to use these utilities to run basic and advanced tests, and protect sites against common attacks.","no_learner":"23,193","video_link":"https://dms.licdn.com/playlist/C4E0DAQHTVCq2FnapZQ/learning-original-video-vbr-720/0/1623279640932?e=1645621200&v=beta&t=2K4nuSlF-L-bw4AM0jgLFl1RJzboJIzO3GK98YHnCr4"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYlbwiVTdqEx8aw6Pr43eoeUSab-WODNZrbA&usqp=CAU","title":"HTML for Educators","level":"Intermediate","creater":"Chris Mattia","date":"March 23, 2017","decription":"If you teach and engage with learners online, then you have probably encountered a need for knowing how to code. That's what this course is for—to help you learn the basics of HTML so you can enhance your teaching and learning materials with dynamic pages. Learn web coding basics, including how to format text, link to other pages, add images, embed resources, use CSS, and add targeted customizations to a learning management system (LMS) or WordPress site. In this course, instructor Chris Mattia demonstrates using HTML and CSS to help you take your lessons to the next level.","no_learner":"21,093","video_link":"https://dms.licdn.com/playlist/C560DAQH8-284R5Popw/learning-original-video-vbr-720/0/1598553189264?e=1645621200&v=beta&t=2tcNHZn08g9X3X5erloiy2i0OcdOKzpDKXFL73zO1CA"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"Semantic HTML and CSS Code Challenges","level":"Intermediate","creater":"Jen Kramer","date":"2,643","decription":"To fully realize what you know about topics like HTML and CSS, it sometimes helps to challenge yourself with small projects. That’s what this course does for you. Over the course’s twelve challenges, instructor Jen Kramer walks you through building a full webpage from scratch, using HTML and CSS. The first group of four challenges involves building a portion of the webpage using a Flexbox-based layout. The second group of four challenges focuses on building a horizontal navigation bar with a CSS-powered hamburger button. The final four challenges step through creating a grid-based layout and combining work completed across challenges to create a beautiful, responsive webpage.","no_learner":"2,643","video_link":"https://dms.licdn.com/playlist/C4E0DAQEQ78F4JG1w5g/learning-original-video-vbr-720/0/1623090759109?e=1645621200&v=beta&t=ObboLqRYfZujJiDwHTjUBC3qgQ5L5a2pCEla6L4tLwY"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML: Metadata in the Head","level":"Beginner","creater":"Jen Kramer","date":"2/19/2020","decription":"Hypertext Markup Language (HTML) is the foundation of website and web application development. It allows you to ensure that your content is understood by both segments of your audience: the people who watch, read, or listen to your content, and the computers that display it. In this course, learn how to craft excellent HTML with the pieces that HTML itself has to offer. Instructor Jen Simmons highlights all of the fundamental concepts you need to use HTML thoughtfully. She focuses on semantic markup: tagging content as what it is, and not just for formatting, convention, or convenience. This has far-reaching impact for those who consume the web differently; it ensures that when a screen reader or a system (like a search engine) consumes a page, it knows exactly what it contains and how to categorize that information.","no_learner":"14,567","video_link":"https://dms.licdn.com/playlist/C560DAQFTgNT2Wg5u4g/learning-original-video-vbr-720/0/1599179805390?e=1645614000&v=beta&t=n9P5o33F4Lxk_4gisuyXJEq0SvKqTTURPInsvmbqz5o"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML Essential Training","level":"Beginner","creater":"Jen Simmons","date":"2/19/2020","decription":"Hypertext Markup Language (HTML) is the foundation of website and web application development. It allows you to ensure that your content is understood by both segments of your audience: the people who watch, read, or listen to your content, and the computers that display it. In this course, learn how to craft excellent HTML with the pieces that HTML itself has to offer. Instructor Jen Simmons highlights all of the fundamental concepts you need to use HTML thoughtfully. She focuses on semantic markup: tagging content as what it is, and not just for formatting, convention, or convenience. This has far-reaching impact for those who consume the web differently; it ensures that when a screen reader or a system (like a search engine) consumes a page, it knows exactly what it contains and how to categorize that information.","no_learner":"12,567","video_link":"https://dms.licdn.com/playlist/C560DAQFTgNT2Wg5u4g/learning-original-video-vbr-720/0/1599179805390?e=1645614000&v=beta&t=n9P5o33F4Lxk_4gisuyXJEq0SvKqTTURPInsvmbqz5o"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2RgNNHwna3H31sRpO_3bNBk4nns2G3AejcQ&usqp=CAU","title":"HTML: Images and Figures","level":"Intermediate","creater":"J. David Eisenberg","date":"May 9, 2018","decription":"The web offers more and more ways to make your graphics accessible, reliably placed, and a smooth fit for a variety of different screens. It's not just IMG anymore. In this course, join J. David Eisenberg as he provides a comprehensive exploration of the many ways to present graphics on web pages. Learn about different image formats—including GIF, PNG, and JPEG—and discover how to adjust and style images using CSS. Plus, learn about the principles of responsive design, how to use the figure and figcaption elements to caption images, and more.","no_learner":"79,939","video_link":"https://dms.licdn.com/playlist/C4D0DAQHN7Xau9BSAtw/learning-original-video-vbr-720/0/1598658689867?e=1645614000&v=beta&t=w1p6ny89C7SxOxMp74oQKGNZC5ILOEITh-38yMq7abI"},{"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS7Rr7ABGnU"}]